{"config": {"layers": [{"name": "input_4", "config": {"dtype": "int32", "sparse": false, "name": "input_4", "batch_input_shape": [null, 500]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "embedding_4", "config": {"name": "embedding_4", "embeddings_constraint": null, "input_dim": 10000, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 500, "output_dim": 100, "embeddings_regularizer": null, "dtype": "float32", "mask_zero": false, "batch_input_shape": [null, 500], "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "reshape_13", "config": {"name": "reshape_13", "trainable": true, "target_shape": [500, 100, 1]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "conv2d_4", "config": {"strides": [1, 1], "activation": "newacti", "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_4", "filters": 64, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 100], "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "inbound_nodes": [[["reshape_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_4", "config": {"padding": "valid", "pool_size": [498, 1], "strides": [1, 1], "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "reshape_16", "config": {"name": "reshape_16", "trainable": true, "target_shape": [500, 100]}, "inbound_nodes": [[["reshape_13", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "reshape_14", "config": {"name": "reshape_14", "trainable": true, "target_shape": [1, 64]}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "gru_8", "config": {"recurrent_dropout": 0.2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "implementation": 1, "kernel_constraint": null, "go_backwards": false, "return_state": false, "stateful": false, "trainable": true, "use_bias": true, "unroll": false, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": true, "name": "gru_8", "bias_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["reshape_16", 0, 0, {}]]], "class_name": "GRU"}, {"name": "gru_7", "config": {"recurrent_dropout": 0.2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "implementation": 1, "kernel_constraint": null, "go_backwards": false, "return_state": false, "stateful": false, "trainable": true, "use_bias": true, "unroll": false, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": true, "name": "gru_7", "bias_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["reshape_14", 0, 0, {}]]], "class_name": "GRU"}, {"name": "conv1d_4", "config": {"strides": [1], "activation": "newacti", "padding": "valid", "dilation_rate": [1], "name": "conv1d_4", "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [5], "trainable": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["gru_8", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "reshape_15", "config": {"name": "reshape_15", "trainable": true, "target_shape": [1, 64]}, "inbound_nodes": [[["gru_7", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "max_pooling1d_4", "config": {"padding": "valid", "name": "max_pooling1d_4", "strides": [4], "trainable": true, "pool_size": [4]}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "MaxPooling1D"}, {"name": "maximum_4", "config": {"name": "maximum_4", "trainable": true}, "inbound_nodes": [[["reshape_15", 0, 0, {}], ["max_pooling1d_4", 0, 0, {}]]], "class_name": "Maximum"}, {"name": "flatten_4", "config": {"name": "flatten_4", "trainable": true}, "inbound_nodes": [[["maximum_4", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dropout_4", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_4", "trainable": true, "seed": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_4", "config": {"activation": "softmax", "name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 46, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense"}], "name": "model_4", "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Model"}